# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Lukas Creutzburg\Documents\GitHub\freeDSP_6CHamp\PSoC Workspace\Volume_Control.cydsn\Volume_Control.cyprj
# Date: Wed, 16 Nov 2016 11:46:17 GMT
#set_units -time ns
create_clock -name {Volume_ADC_Ext_CP_Clk(routed)} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {Volume_ADC_Ext_CP_Clk} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Volume_ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 17 33} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {Volume_ADC_theACLK(fixed-function)} -period 666.66666666666663 -waveform {0 333.333333333333} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {ADC_Clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 939 1875} -nominal_period 39083.333333333328 [list [get_pins {ClockBlock/dclk_glb_1}]]


# Component constraints for C:\Users\Lukas Creutzburg\Documents\GitHub\freeDSP_6CHamp\PSoC Workspace\Volume_Control.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Lukas Creutzburg\Documents\GitHub\freeDSP_6CHamp\PSoC Workspace\Volume_Control.cydsn\Volume_Control.cyprj
# Date: Wed, 16 Nov 2016 11:46:13 GMT
